new Vue({
    el: ".footer-floor1",
    data() {
        return {
            ul: [
                {
                    top: [{
                        title: "新手指南",
                        li: [
                            { t1: "注册新用户" },
                            { t1: "商品订购流程" },
                            { t1: "会员注册协议" },
                        ]
                    }]
                },
                {
                    top: [{
                        title: "付款方式",
                        li: [
                            { t1: "支付宝支付" },
                            { t1: "网上银行支付" },
                            { t1: "货到付款" },
                        ]
                    }]
                },
                {
                    top: [{
                        title: "常见问题",
                        li: [
                            { t1: "订单状态" },
                            { t1: "发票说明" },
                            { t1: "货到付款" },
                        ]
                    }]
                },
                {
                    top: [{
                        title: "售后服务",
                        li: [
                            { t1: "退换货政策" },
                            { t1: "退换货流程" },
                            { t1: "退款说明" },
                            { t1: "退换货申请" }
                        ]
                    }]
                },
                {
                    top: [{
                        title: "客服中心",
                        li: [
                            { t1: "常见问题" },
                            { t1: "联系客服" },
                            { t1: "投诉与建议" },
                        ]
                    }]
                },
            ]
        }
    },
})