var vm = new Vue({
    el: ".actqbspBOX",
    data() {
        return {
            mes: "123",
            ul: [
                {
                    top: [
                        {
                            title: "功能产品",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "智能设备",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "服装箱包",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "美妆护肤",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "珠宝饰品",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "联想" },
                                    { tt1: "美图" },
                                    { tt1: "乐视" },
                                    { tt1: "奇酷" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "智能设备",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "数码家电",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "智能设备",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "食品茶酒",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "联想" },
                                    { tt1: "美图" },
                                    { tt1: "乐视" },
                                    { tt1: "奇酷" }]
                                },
                                {
                                    t1: "智能设备",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" },
                                    { tt1: "联想" },
                                    { tt1: "美图" },
                                    { tt1: "乐视" },
                                    { tt1: "奇酷" }]
                                }
                            ]
                        }
                    ]
                },
                {
                    top: [
                        {
                            title: "运动体育",
                            main: [
                                {
                                    t1: "手机",
                                    t2: [
                                        { tt1: "全部手机" },
                                        { tt1: "小米" },
                                        { tt1: "iPhone" },
                                        { tt1: "华为" },
                                        { tt1: "三星" },
                                        { tt1: "魅族" },
                                        { tt1: "PPTV" },
                                        { tt1: "一加" },
                                        { tt1: "OPPO" },
                                        { tt1: "vivo" },
                                        { tt1: "联想" },
                                        { tt1: "美图" },
                                        { tt1: "乐视" },
                                        { tt1: "奇酷" }
                                    ]
                                },
                                {
                                    t1: "手机配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "摄像摄影",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "数码配件",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                },
                                {
                                    t1: "智能设备",
                                    t2: [{ tt1: "全部手机" },
                                    { tt1: "小米" },
                                    { tt1: "iPhone" },
                                    { tt1: "华为" },
                                    { tt1: "三星" },
                                    { tt1: "魅族" },
                                    { tt1: "PPTV" },
                                    { tt1: "一加" },
                                    { tt1: "OPPO" },
                                    { tt1: "vivo" }]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    },
})